tutorials/overtopping/bm1.58/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];


internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            waveVelocity;
        refValue        uniform ( 0 0 0 );
        refGradient     uniform ( 0 0 0 );
        valueFraction   uniform 1;
        value           uniform (0 0 0);
    }
    outlet
    {
        type            waveVelocity;
        refValue        uniform ( 0 0 0 );
        refGradient     uniform ( 0 0 0 );
        valueFraction   uniform 1;
        value           uniform (0 0 0);
    }
    bottom
    {
        type            noSlip;
    }
    atmosphere
    {
        type            noSlip;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
